Tekla Open API Reference for Tekla Structures 2025
ComponentOptions Constructor
Initializes a new instance of the ComponentOptions class
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ComponentOptions()
Public Sub New
See Also
Reference
ComponentOptions Class
Tekla.Structures Namespace